golden-gate-server2/app/controllers/api/v1/carts_controller.rb

  def show
  	decoded_token = authorize_account(request.headers["HTTP_TOKEN"])
  	member = Member.find(decoded_token.first["member_id"])
  	if(decoded_token.present?)
  		order = Order.find_by(member_id: decoded_token.first["member_id"], order_status: "incart")
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT "members".* FROM "members"
SELECT  "orders".* FROM "orders" WHERE "orders"."member_id" = ? AND "orders"."order_status" = ? LIMIT ?  [["member_id", 18], ["order_status", "incart"], ["LIMIT", 1]]