golden-gate-server2/app/controllers/api/v1/members_controller.rb

	def check_validity
		member = Member.new(member_params)
		if(member.valid?)
			security_question_instances = SecurityQuestion.all
---
SELECT "security_questions".* FROM "security_questions"

	def create
		member = Member.new(member_params)
		if (member.save)
---
INSERT INTO "members" ("first_name", "last_name", "gender", "birthday", "email", "encrypted_password", "created_at", "updated_at", "signed_up_on") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)