golden-gate-server2/app/controllers/api/v1/products_controller.rb

  def index
  	products = Product.all
---
SELECT "products".* FROM "products"