golden-gate-server2/app/controllers/api/v1/security_questions_controller.rb

	def create
		decoded_token = authorize_account(request.headers["HTTP_TOKEN"]).first #only to retrieve member.id and not to authenticate
		# array_of_question_ids_and_answers = []
		params["questionsAndAnswers"].each do |ques, ans|
			SecurityQuestion.all.each do |question|
				if(question.question === ques)
					# array_of_question_ids_and_answers.push({question.id => ans})
					SecurityQuestionAnswer.create(member_id: decoded_token["member_id"], security_question_id: question.id, answer: ans)
---
SELECT "security_questions".* FROM "security_questions"
INSERT INTO "security_question_answers" ("member_id", "security_question_id", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["member_id", 25], ["security_question_id", 1], ["answer", "mani"], ["created_at", "2017-09-15 01:44:30.240796"], ["updated_at", "2017-09-15 01:44:30.240796"]]