golden-gate-server2/app/controllers/api/v1/sign_in_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."email" = ? LIMIT ?  [["email", "dfdfd"], ["LIMIT", 1]]
---
  def create
  	downcased_email = params[:email].downcase
  	member = Member.find_by(email: downcased_email)